import streamlit as st
from PIL import Image


def show_experience():
    st.header("Опыт работы")
    st.write("**Преподаватель информатики, АНПОО 'Кубанский ИПО'**")
    st.write("Январь 2020 - по настоящее время")
    st.markdown("""
    - Проведение лекционных и практических занятий.
        - Общая информатика.
        - Информационные технологии в профессиональной деятельности.
        - Web-программирование.
    - Проверка качества выполнения практических работ.
    - Составление рабочей документации, рабочих программ и планов проведения занятий.
    - Заполнение отчетной документации.
    ---
    """)

    st.write("**Учитель математики и информатики, МБОУ СОШ №31 с. Шаумян**")
    st.write("Сентябрь 2018 - Июнь 2019")
    st.markdown("""
    - Ведение преподавательской деятельности: Информатика и математика 6-11 классы.
    - Администрирование компьютерной сети школы. Тех поддержка сайта школы.
    ---
    """)

    st.write("**Системный администратор, МБУЗ 'Туапсинская районная больница №3'**")
    st.write("Июль 2017 - Февраль 2019")
    st.markdown("""
    Основные обязанности:
    - Поддержание компьютерной сети в работоспособности.
    - Прокладка и настройка локальных сетей.
    - Обслуживание офисной техники.
    - Блочный ремонт компьютеров.
    - Обучение и консультирование сотрудников.
    - Общение с разработчиками специализированных программных продуктов и сервисов.
    - Заполнение и сдача отчетности.
    - Переписка с государственными органами, контролирующими информатизацию в бюджетных организациях.
    - Парус 8.
    """)