import streamlit as st


def show_experience():
    st.header("Опыт работы")

    st.markdown("### Самозанятый ###")
    st.markdown("Май 2024 - по настоящее время")
    st.markdown('''Выполнение заказных работ по разработке на Python.  
    
---
    ''')

    st.markdown("### Преподаватель информатики, АНПОО Кубанский ИПО ###")
    st.markdown("Январь 2020 - по настоящее время")
    st.markdown('''
    Заполнение отчетной документации.  
    Составил рабочую документацию, рабочие программы и планы проведения занятий.  
    Внедрил сдачу практических работ на облачный диск с последующей проверкой.  
    Обучил студентов работе с репозиториями Git.  
      
    Проведение лекционных и практических занятий:
    - Общая информатика.  
    - Информационные технологии в профессиональной деятельности.  
    - Web-программирование.  
    ---
    ''')

    st.markdown("### Учитель математики и информатики, МБОУ СОШ №31 с. Шаумян ###")
    st.markdown("Сентябрь 2018 - Июнь 2019")
    st.markdown("""
    - Ведение преподавательской деятельности: Информатика и математика 6-11 классы.  
    - Администрирование компьютерной сети школы. Тех поддержка сайта школы.  
    ---
    """)

    st.markdown("### Системный администратор, МБУЗ 'Туапсинская районная больница №3' ###")
    st.markdown("Июль 2017 - Февраль 2019")
    st.markdown("""
    Основные обязанности:  
    - Поддержание и обеспечение работоспособности компьютерной сети.  
    - Обслуживание офисной техники и блочный ремонт компьютеров.  
    - Обучение и консультирование сотрудников по вопросам использования IT-ресурсов.  
    - Взаимодействие с разработчиками специализированных программных продуктов и сервисов.  
    - Заполнение и сдача отчетности.  
    - Переписка с государственными органами, контролирующими информатизацию в бюджетных организациях.  
    - Работа с системой «Парус 8».  
    - Участвовал в перепроектировании, прокладке и настройке локальной сети.  
    - Участвовал во внедрении нового модуля автоматической загрузки отчетности.  
    """)